def expon_var1 (base, exp):
    """Возвращает результат возведения в степень.

    Позиционные параметры:
    base -- основание степени
    exp  -- показатель степени
    """
    if base <= 0 or exp >= 0:  # проверка корректности основания и показателя
       return('Некорректное основание и/или некорректный показатель степени!')
    else:
        return base ** exp


def expon_var2 (base, exp):
    """Возвращает результат возведения в степень.

    Позиционные параметры:
    base -- основание степени
    exp  -- показатель степени
    """
    if base <= 0 or exp >= 0:  # проверка корректности основания и показателя
       return('Некорректное основание и/или некорректный показатель степени!')
    else:
        i = 0
        result = 1
        while(i < abs(exp)):
            result *= 1 / base
            i += 1
    return result

print(f'Результат: {expon_var1(5, 2)}')
print(f'Результат: {expon_var2(5, 2)}')
print(f'Результат: {expon_var1(5, -2)}')
print(f'Результат: {expon_var2(5, -2)}')
print(f'Результат: {expon_var1(15, -3)}')
print(f'Результат: {expon_var2(15, -3)}')
